module.exports =  {
    REQUEST_SUCCESS: 200,
    CHUNK_SIZE: 40*1024*1024, //分片大小
    EDUCATION:{//学历
        '0': "--",
        '1': "本科",
        '2': "硕士研究生",
        '3': "博士研究生",
        '4': "高中",
        '5': "专科",
    },
    DEGREE:{//学位
        '0': "--",
        '1': "学士",
        '2': "硕士",
        '3': "博士",
        '4': "副学士",
        '5': "其他"
    },
    IDEN_TYPE:{//身份证类型
        '1': "身份证",
        '2': "护照",
        '3': "3军人证"
    },
    POLITICAL:{//政治面貌
        '0': "--",
        '1': "党员",
        '2': "团员",
        '3': "群众",
    },
    SEX:{//性别
        '1': "男",
        '2': "女",
        '3': "--",
    },
    CUSTOM_TYPE:{
        '1': "用户",
        '2': "用户和管理员",
        '3': "租户管理员",
        '4': "多级管理员",
        '5': "其他",
    },
    NODE_TYPE:{
        'DEPT': '部门',
        'ORG': '单位'
    },
    RULE_TYPE:{
        'PUBLIC': '公共规则',
        'MODULE': '模块资源规则',
        'SYSTEM': '预置规则',
    },
    //公钥
    SERVUCEPUBLICKEY: '0416e39a2a5023e90a4f8d0c663b7f9e21bcd430c122e767150b201dd5935d8953a08227be68de4a04c46d46c6b2644d3042889404a7dcda92c7f211ee29f20c8e',

}
